Repository: Odyseus/CinnamonTools
Catalog: applets/DesktopCaptureForkByOdyseus/po/*.po
Languages: es

source: _Cancel
es: _Cancelar

source: _OK
es: Aceptar

source: Help
es: Ayuda

source: _Save
es: _Guardar

source: _Open
es: _Abrir

source: Select or enter file to export to
es: Seleccionar o ingresar el archivo hacia el cual exportar

source: JSON files
es: Archivos JSON

source: Verbose
es: Detallado

source: Very verbose
es: Muy detallado

source: Debugging
es: Configuración de depuración

source: It enables the ability to catch all exceptions that under normal use would not be caught.
es: Permite la posibilidad de capturar todas las excepciones que, en el uso normal, no se detectarían.

source: Select a file to import
es: Seleccionar un archivo desde el cual importar

source: See this xlet help file.
es: Ver el archivo de ayuda de este xlet.

source: Bug reports, feature requests and contributions should be done on this xlet's repository linked next.
es: Los reportes de fallos, peticiones de características y contribuciones deben hacerse en el repositorio de este xlet vinculado a continuación.

source: Help for %s
es: Ayuda para %s

source: Contributors
es: Colaboradores

source: The following sections are available only in English.
es: Las siguientes secciones están disponibles sólo en Inglés.

source: This xlet is compatible with Cinnamon %s up to latest Cinnamon version.
es: Este xlet es compatible con Cinnamon %s hasta la última versión de Cinnamon.

source: This xlet is compatible with Cinnamon {0} up to {1}.
es: Este xlet es compatible con Cinnamon {0} hasta {1}.

source: Cinnamon compatibility
es: Compatibilidad con Cinnamon

source: Warning
es: Advertencia

source: Never delete any of the files found inside this xlet folder. It might break this xlet functionality.
es: Jamás borrar ninguno de los archivos encontrados dentro de la carpeta de este xlet. Podría romper la funcionalidad del xlet.

source: Xlets localization
es: Localización de xlets

source: If this xlet was installed from Cinnamon Settings, all of this xlet's localizations were automatically installed.
es: Si este xlet se instaló desde Configuración de Cinnamon, todas las localizaciones de este xlet se instalaron automáticamente.

source: If this xlet was installed manually and not trough Cinnamon Settings, localizations can be installed by executing the script called helper.py from a terminal opened inside the xlet's folder.
es: Si este xlet se instaló manualmente y no a través de Configuración de Cinnamon, las localizaciones se pueden instalar ejecutando el archivo llamado helper.py desde una terminal abierta dentro de la carpeta del xlet.

source: Normal icon
es: Ícono normal

source: Select an icon to show in the panel.
es: Seleccionar un ícono a mostrar en el panel.

source: Select an icon to show in the panel when screencasting is active.
es: Seleccionar un icono para mostrar en el panel cuando el screencasting esté activo.

source: Display menu quick options in a submenu
es: Mostrar las opciones rápidas del menú en un submenú

source: Save location
es: Ubicación de guardado

source: Path to a folder to save new screenshots.
es: Ruta a una carpeta para guardar capturas de pantalla.

source: File name format
es: Formato del nombre de archivo

source: Show capture timer
es: Mostrar temporizador de captura

source: Whether to show the timer on the screen.
es: Mostrar o no el temporizador en la pantalla.

source: Capture windows as area
es: Capturar ventanas como áreas

source: Asking the desktop manager for a screenshot of a window would usually result in a nice image retaining any transparent regions. But depending on the graphics drivers and Cinnamon version it may turn out black or distorted.
es: Pedirle al administrador de escritorio una captura de pantalla de una ventana generalmente resultaría en una buena imagen que retendría cualquier región transparente. Pero dependiendo de los controladores gráficos y la versión Cinnamon puede resultar en una imagen negra o distorsionada.

source: Include window frame
es: Incluir marco de ventana

source: Whether to include the window frame and titlebar in window captures.
es: Incluir o no el marco de la ventana y la barra de título en las capturas de ventana.

source: Show camera flash
es: Mostrar flash de la cámara

source: Include highlight style on screenshot
es: Incluir estilo de resaltado en la captura de pantalla

source: When taking a screenshot of the Cinnamon UI, include the highlight effect in the captured image. The 'desktop-capture-capture-outline-frame' CSS class is the one that style the highlight effect.
es: Al tomar una captura de pantalla de la interfaz de usuario de Cinnamon, incluir el efecto de resaltado en la imagen capturada. La clase CSS 'desktop-capture-capture-outline-frame' es la que da estilo al efecto de resalte.

source: Play shutter sound
es: Reproducir sonido de obturador

source: Play timer interval sound
es: Reproducir el sonido de intervalo de temporizador

source: Show toggle button for copying image to clipboard
es: Mostrar el botón de alternar para copiar la imagen al portapapeles

source: Whether to show another toggle button in the menu for copying image to clipboard. If you have notifications enabled you probably don't need this set.
es: Mostrar o no el botón de alternar en el menú para copiar la imagen al portapapeles. Si tiene habilitadas las notificaciones, probablemente no necesite esta opción.

source: Turn off auto copy image data toggle after capture
es: Desactivar la copia automática de los datos de la imagen después de la captura

source: When set, the copy image to clipboard toggle button override will be turned off after a successful capture.
es: Cuando se configura, la anulación del botón de alternancia de la imagen de copia al portapapeles se desactivará después de una captura exitosa.

source: Copy to clipboard
es: Copiar al portapapeles

source: Whether to copy the file path or image data of screenshots to clipboard after capture.
es: Copiar o no la ruta del archivo o los datos de imagen de las capturas de pantalla al portapapeles después de la captura.

source: Off
es: Apagado

source: File path
es: Ruta de archivo

source: Image data
es: Datos de imagen

source: Path to a folder for new screen recordings.
es: Ruta a una carpeta para nuevas grabaciones de pantalla.

source: Capture a window
es: Capturar una ventana

source: Capture an area
es: Capturar un área

source: Capture a Cinnamon UI element
es: Capturar un elemento de interfaz de Cinnamon

source: Cinnamon only.
es: Solo Cinnamon.

source: Capture the screen
es: Capturar la pantalla

source: Capture monitor 1
es: Capturar monitor 1

source: Capture monitor 2
es: Capturar monitor 2

source: Capture monitor 3
es: Capturar monitor 3

source: Repeat last capture
es: Repetir última captura

source: Start/stop recording
es: Empezar/Detener grabación

source: Will start only Cinnamon Recorder. Will stop any recorder using its stop-command.
es: Comenzará solo el grabador de Cinnamon. Detendrá cualquier grabador usando su comando de parada (stop-command).

source: Appearance
es: Apariencia

source: Overlay theme
es: Tema de capa sobrepuesta

source: These themes are used to style the Cinnamon helpers overlay (area selector, window selector, etc.). The built-in themes can be found in APPLET_FOLDER/themes and can be used as a base to create a custom theme.
es: Estos temas se utilizan para dar estilo a los asistentes de Cinnamon (selector de área, selector de ventana, etc.). Los temas incorporados se pueden encontrar en CARPETA_DEL_APPLET/themes y se pueden usar como base para crear un tema personalizado.

source: Light overlay
es: Capa sobrepuesta clara

source: Dark overlay
es: Capa sobrepuesta oscura

source: Path to custom stylesheet
es: Ruta a la hoja de estilo personalizada

source: Description
es: Descripción

source: This applet is a fork of [Desktop Capture](https://github.com/rjanja/desktop-capture) applet by Rob Adams (a.k.a. rjanja).
es: Este applet es una modificación del applet [Captura de Escritorio](https://github.com/rjanja/desktop-capture) por Rob Adams (también conocido como rjanja).

source: Differences with the original applet
es: Diferencias con el applet original

source: The principal differences of this fork with the original applet are in usability and of the kind 'do more with less code'.
es: Las principales diferencias de este applet con el applet original son la facilidad de uso y del tipo "hacer más con menos código".

source: More convenient handling of settings. Most settings can be changed directly from the applet menu or its context menu without the need to constantly open the applet settings window.
es: Manejo más conveniente de preferencias. La mayoría de las configuraciones se pueden cambiar directamente desde el menú del applet o su menú contextual sin la necesidad de abrir constantemente la ventana de configuración del applet.

source: Keyboard shortcuts are not only available for Cinnamon's built-in features, but for all screenshot/screencast programs.
es: Los atajos de teclado no solo están disponibles para las funciones integradas de Cinnamon, sino tambié para todos los programas de captura de pantalla/screencast.

source: Settings are immediately available after changed without the need to restart Cinnamon.
es: Las configuraciones están disponibles inmediatamente después de cambiarlas sin la necesidad de reiniciar Cinnamon.

source: The 'Repeat last' item isn't only available for Cinnamon's screenshots, but for any device and any program.
es: El elemento 'Repetir el último' no solo está disponible para las capturas de pantalla de Cinnamon, sino para cualquier dispositivo y programa.

source: Programs support
es: Soporte de programas

source: In addition to Cinnamon's built-in screenshot/screencast tools, this applet also supports third-party programs to take captures. By default, this applet comes with support for several known programs (Shutter, Gnome Screenshot, XWD, ImageMagic, FFmepg, RecordMyDesktop, Byzanz and Kazam).
es: Además de las herramientas integradas de captura de pantalla/screencast de Cinnamon, este applet también admite programas de terceros para realizar capturas. Por defecto, este applet viene con soporte para varios programas conocidos (Shutter, Gnome Screenshot, XWD, ImageMagic, FFmepg, RecordMyDesktop, Byzanz y Kazam).

source: Highlights
es: Destacados

source: Programs are stored inside an applet preference. They are grouped by devices. A device called **camera** that contains programs that take screenshots. And a device called **recorder** that contains programs that capture screencasts.
es: Los programas se almacenan dentro de una preferencia del applet. Están agrupados por dispositivos. Un dispositivo llamado **camera** que contiene programas que toman capturas de pantalla. Y un dispositivo llamado **recorder** que contiene programas que capturan screencasts.

source: Programs can be added/removed/modified as much as needed/wanted from this applet context menu by simply exporting the existent programs, modifying the generated JSON file and importing the modified file again.
es: Los programas pueden ser agregados/eliminados/modificados tanto como sea necesario/deseado desde el menú contextual del applet simplemente exportando los programas existentes, modificando el archivo JSON generado e importando nuevamente el archivo modificado.

source: Commands are exactly that, commands. They are composed of command line arguments , placeholders, and/or flags.
es: Los comandos son exactamente eso, comandos. Se componen de argumentos de línea de comando, marcadores de posición y/o indicadores.

source: Placeholders are strings specifically formatted with double curly braces (`{{PLACEHOLDER_NAME}}`) and can be placed in any part of a string. These strings are replaced with dynamically generated data (an applet preference, screen coordinates, etc.) when a command is executed.
es: Los marcadores de posición son cadenas específicamente formateadas con llaves dobles (`{{NOMBRE_DE_MARCADOR_DE_POSICIÓN}}`) y se pueden colocar en cualquier parte de una cadena. Estas cadenas se reemplazan con datos generados dinámicamente (una preferencia de applet, coordenadas de pantalla, etc.) cuando se ejecuta un comando.

source: Flags are another type of specifically formatted strings surrounded by hashes (`#FLAG_NAME#`) and they always must be placed at the beginning of a string. Flags indicate that an action must be taken before a command is executed.
es: Los indicadores son otro tipo de cadenas con formato específico rodeadas de numerales (hashes) (`#NOMBRE_DE_INDICADOR#`) y siempre deben colocarse al principio de una cadena. Los indicadores indican que se debe realizar una acción antes de ejecutar un comando.

source: The exported JSON file exemplifies almost all the options, flags and placeholders documented below.
es: El archivo JSON exportado ejemplifica casi todas las opciones, indicadores y marcadores de posición documentados a continuación.

source: The command that will be executed can be previewed before actually executing it by simply right clicking a menu item.
es: El comando que se ejecutará puede previsualizarse antes de ejecutarlo simplemente haciendo clic derecho en un elemento del menú.

source: Warnings
es: Advertencias

source: All option names, flags, and placeholders are case sensitive. Command option names are lower cased and use dashes as word separators. Placeholders and flags are upper cased and use low dashes as word separators.
es: Todos los nombres de opciones, indicadores y marcadores de posición distinguen entre mayúsculas y minúsculas. Los nombres de las opciones de comando están en minúsculas y usan guiones como separadores de palabras. Los marcadores de posición y los indicadores están en mayúsculas y usan guiones bajos como separadores de palabras.

source: An imported JSON file will overwrite an existent preference.
es: Un archivo JSON importado sobrescribirá una preferencia existente.

source: Importing a malformed/invalid JSON file will cancel the import operation without modifying an existent preference.
es: La importación de un archivo JSON con formato incorrecto/inválido cancelará la operación de importación sin modificar una preferencia existente.

source: There isn't a mechanism to check if a command is available or not on the system the applet is installed. So, use common sense.
es: No hay un mecanismo para verificar si un comando está disponible o no en el sistema en el que está instalado el applet. Entonces, usa el sentido común.

source: Basic example
es: Ejemplo básico

source: Program/Command name
es: Nombre de programa/comando

source: Name of the program shown on the program selector menu
es: Nombre del programa mostrado en el menú selector de programas.

source: Argument to include sound in capture
es: Argumento para incluir sonido en captura

source: Argument to not include sound in capture
es: Argumento para no incluir sonido en captura

source: Command to stop recording
es: Comando para detener la grabación

source: This is a separator
es: Este es un separador

source: Argument to include cursor in capture
es: Argumento para incluir cursor en captura

source: Argument to not include cursor in capture
es: Argumento para no incluir cursor en captura

source: The content here will be used to replace the {{APPEND_1}} placeholder
es: El contenido aquí se usará para reemplazar el marcador de posición {{APPEND_1}}

source: Menu item label
es: Etiqueta del ítem de menú

source: Menu item label flags
es: Indicadores de etiqueta de ítems de menú

source: See %s.
es: Ver %s.

source: Command to execute when clicking this menu item
es: El comando a ejecutar al cliquear este ítem de menú

source: Program options
es: Opciones de programa

source: Option
es: Opción

source: Usage
es: Uso

source: Mandatory
es: Obligatorio

source: This option will be used as the program name in the program selector sub-menu.
es: Esta opción se usará como nombre del programa en el submenú del selector de programas.

source: This option contains all the data that will be used to create the menu items for a program.
es: Esta opción contiene todos los datos que se utilizarán para crear los elementos del menú para un programa.

source: Recorder only
es: Sólo grabador

source: The command to stop recording a screencast.
es: El comando para detener la grabación de un screencast

source: Camera only
es: Sólo cámara

source: Optional
es: Opcional

source: This option is used in combination with the `{{DELAY}}` placeholder. If set to **true**, sets the visibility of the **Capture delay** option inside this applet menu.
es: Esta opción se usa en combinación con el marcador de posición `{{DELAY}}`. Si se establece en **true**, establece la visibilidad de la opción **Retraso de captura** dentro de este menú del applet.

source: This option, if set to **true**, sets the visibility of the **Frames per second** option inside this applet menu.
es: Esta opción habilitada, establece la visibilidad de la opción **Cuadros por segundo** dentro de este menú de applet.

source: This option is used in combination with the `{{CURSOR}}` placeholder. It must contain two keys named **on** and **off** which respectively must contain a comand line argument for enabling/disabling the display of the mouse cursor on the captured file.
es: Esta opción se usa en combinación con el marcador de posición `{{CURSOR}}`. Debe contener dos propiedades denominadas **on** y **off** que, respectivamente, deben contener un argumento de línea de comando para habilitar/deshabilitar la visualización del cursor del ratón en el archivo capturado.

source: This option is used in combination with the `{{SOUND}}` placeholder. It must contain two keys named **on** and **off** which respectively must contain a comand line argument for enabling/disabling the inclusion of sound on the captured file.
es: Esta opción se usa en combinación con el marcador de posición `{{SOUND}}`. Debe contener dos propiedades denominadas **on** y **off** que, respectivamente, deben contener un argumento de línea de comando para habilitar/deshabilitar la inclusión de sonido en el archivo capturado.

source: These options are used in combination with the `{{APPEND_1}}` to `{{APPEND_10}}` placeholders. This is done to avoid repeating the same arguments on all menu items commands.
es: Estas opciones se usan en combinación con los marcadores de posición `{{APPEND_1}}` a `{{APPEND_10}}`. Esto se hace para evitar repetir los mismos argumentos en todos los comandos de los elementos del menú.

source: Flags
es: Indicadores

source: Flag
es: Indicador

source: The hash (#) character in front of a menu item label is a flag that inhibits the menu item from changing the state of the applet (the change of the applet icon from normal to recording).
es: El signo numeral (#) delante de la etiqueta de un elemento del menú es un indicador que impide que el elemento del menú cambie el estado del applet (el cambio del icono del applet de normal a la grabación).

source: Menu item command flags
es: Indicadores de comando de ítems de menú

source: Menu item command interactive placeholders
es: Marcadores de posición interactivos de comando de ítem de menú

source: This flag will allow the use of this applet area selector helper. See %s
es: Este indicador permitirá el uso del ayudante selector de área de este applet. Ver %s

source: This flag will allow the use of this applet window selector helper. See %s
es: Este indicador permitirá el uso del ayudante de selección de ventana de este applet. Ver %s

source: Menu item command placeholders
es: Marcadores de posición de comando de ítem de menú

source: Placeholder
es: Marcador de posición

source: Placeholder for the program options `append-1` to `append-10`.
es: Marcador de posición para las opciones de programa `append-1` a `append-10`.

source: The command line argument used to decide if the capture will display the cursor or not.
es: El argumento de la línea de comando utilizado para decidir si la captura mostrará el cursor o no.

source: Delay in seconds before taking a screenshot.
es: Retraso en segundos antes de tomar una captura de pantalla.

source: The directory used as storage for the captures.
es: El directorio utilizado como almacenamiento para las capturas.

source: The file extension that the generated capture will have. It has to be used in pairs (Example: `{{EXT}}png{{EXT}}`).
es: La extensión de archivo que tendrá la captura generada. Debe usarse en pares (Ejemplo: `{{EXT}}png{{EXT}}`).

source: The file name (no extension included) that the generated capture will have.
es: El nombre del archivo (sin extensión incluida) que tendrá la captura generada.

source: Frames per second (frame rate).
es: Fotogramas por segundo (velocidad de fotogramas).

source: The directory used to store the screencast captures.
es: El directorio utilizado para almacenar las capturas de screencast.

source: The screen dimensions with format `widthxheight`. Example: `1440x900`
es: Las dimensiones de la pantalla con formato `anchoxalto`. Ejemplo: `1440x900`.

source: The screen height.
es: El alto de la pantalla.

source: The screen width.
es: El ancho de la pantalla.

source: The directory used to store the screenshot captures.
es: El directorio utilizado para almacenar las capturas de pantalla.

source: The command line argument used to decide if the capture include sound or not.
es: El argumento de la línea de comando utilizado para decidir si la captura incluye sonido o no.

source: `x` screen coordinates.
es: Coordenadas de pantalla `x`.

source: `y` screen coordinates.
es: Coordenadas de pantalla `y`.

source: `x` and `y` screen coordinates separated by a comma.
es: Coordenadas de pantalla `x` e `y` separadas por una coma.

source: It could be either the width of a selected area or the width of a selected window.
es: Puede ser el ancho de un área seleccionada o el ancho de una ventana seleccionada.

source: It could be either the height of a selected area or the height of a selected window.
es: Puede ser la altura de un área seleccionada o la altura de una ventana seleccionada.

source: Same as `I_WIDTH`, but with `1` added to its value.
es: Igual que `I_WIDTH`, pero con `1` agregado a su valor.

source: Same as `I_HEIGHT`, but with `1` added to its value.
es: Igual que `I_HEIGHT`, pero con `1` agregado a su valor.

source: The selected window ID.
es: El ID de la ventana seleccionada.

source: The 'x-window' property of the selected window.
es: La propiedad 'x-window' de la ventana seleccionada.

source: The selected window class name.
es: El nombre de clase de la ventana seleccionada.

source: The selected window class title.
es: El título de la clase de la ventana seleccionada.

source: Cinnamon recorder profiles
es: Perfiles del grabador de Cinnamon

source: The built-in Cinnamon recorder uses the GStreamer general-purpose multimedia framework ([GStreamer documentation](https://gstreamer.freedesktop.org/documentation/index.html)). It generates a video file with the `webm` extension using the `vp8enc` encoder and the `webmmux` muxer. This applet exposes the use of the Cinnamon recorder through profiles.
es: El grabador incorporado en Cinnamon utiliza el marco multimedia de propósito general GStreamer ([documentación de GStreamer](https://gstreamer.freedesktop.org/documentation/index.html)). Genera un archivo de video con la extensión `webm` usando el codificador `vp8enc` y el muxer `webmmux`. Este applet expone el uso del grabador Cinnamon a través de perfiles.

source: Profiles are stored inside an applet preference.
es: Los perfiles se almacenan dentro de una preferencia del applet.
