Repository: Odyseus/CinnamonTools
Catalog: applets/DesktopCaptureForkByOdyseus/po/*.po
Languages: es

source: Profiles can be added/removed/modified as much as needed/wanted from this applet context menu by simply exporting the existent profiles, modifying the generated JSON file and importing the modified file again.
es: Perfiles pueden ser agregados/eliminados/modificados tanto como sea necesario/deseado desde el menú contextual del applet simplemente exportando los perfiles existentes, modificando el archivo JSON generado e importando nuevamente el archivo modificado.

source: Like everything coming from Gnome, GStreamer is an always-evolving-never-finished-barely-functional piece of software. With that in mind, when using the wrong combination of encoder/muxer, Cinnamon will miserably crash. So, experiment at your own risk.
es: Como todo lo que viene de Gnome, GStreamer es una pieza de software que siempre-evoluciona-nunca-termina-apenas-funciona. Teniendo esto en cuenta, cuando se utiliza la combinación incorrecta de codificador/mezclador, Cinnamon se estrellará de forma miserable. Entonces, experimenta bajo tu propio riesgo.

source: Below are the two Cinnamon recorder profiles shipped with this applet. The profile named default cannot be modified/deleted.
es: A continuación se muestran los dos perfiles del grabador de Cinnamon que se incluyen con este applet. El perfil llamado default no puede ser modificado/borrado.

source: Profile options
es: Opciones de perfil

source: All profile options are mandatory.
es: Todas las opciones de perfil son obligatorias.

source: Name of the profile shown on the profile selector menu.
es: Nombre del perfil mostrado en el menú de selección de perfil.

source: Basic description of the profile that will be displayed as a tooltip.
es: Descripción básica del perfil que se mostrará como información sobre herramientas.

source: The file extension of the generated file.
es: La extensión de archivo del archivo generado.

source: GStreamer pipeline.
es: Conducto GStreamer.

source: Keyboard shortcuts
es: Atajos de teclado

source: Keyboard shortcuts are tied to specific capture types.
es: Los atajos de teclado están vinculados a tipos de captura específicos.

source: Known issues
es: Problemas conocidos

source: Cinnamon 3.0.x and its built-in screenshot mechanism
es: Cinnamon 3.0.x y su mecanismo de captura de pantalla incorporado

source: The Cinnamon's 3.0.x built-in screenshot mechanism is broken!
es: ¡El mecanismo de captura de pantalla incorporado de Cinnamon 3.0.x está roto!

source: Do not use it or Cinnamon will crash!
es: ¡No lo uses o Cinnamon se estrellará!

source: It can only be fixed by building from source the cinnamon package for version 3.0.x with the following patch (%s). Or by simply updating to any other newer version of Cinnamon (3.2.x, 3.4.x, etc.).
es: Solo se puede arreglar compilando desde la fuente el paquete cinnamon para la versión 3.0.x con el siguiente parche (%s). O simplemente actualizando a cualquier otra versión más reciente de Cinnamon (3.2.x, 3.4.x, etc.).

source: To permanently dismiss the critical notification displayed when the applet is used under Cinnamon 3.0.x, enable the option found in this applet settings window called "I read the disclaimer and I'm aware of the consequences", under the "Disclaimer" section.
es: Para descartar permanentemente la notificación crítica que se muestra cuando se utiliza el applet en Cinnamon 3.0.x, habilitar la opción que se encuentra en esta ventana de configuración del applet llamada "Leí el descargo de responsabilidad y soy consciente de las consecuencias", bajo la sección "Descargo de responsabilidad".

source: Open screenshots folder
es: Abrir carpeta de capturas de pantalla

source: Open screencasts folder
es: Abrir carpeta de screencasts

source: Export programs
es: Exportar programas

source: Import programs
es: Importar programas

source: Reset programs
es: Restablecer programas

source: Remove all programs
es: Eliminar todos los programas

source: Export profiles
es: Exportar perfiles

source: Import profiles
es: Importar perfiles

source: Reset profiles
es: Restablecer perfiles

source: Remove all profiles
es: Eliminar todos los perfiles

source: Choose camera
es: Eligir cámara

source: Choose recorder
es: Elegir grabador

source: Latest capture
es: Última captura

source: Screenshot
es: Captura de pantalla

source: Assign a title to your program!!!
es: ¡Asignar un título a tu programa!

source: Disabled
es: Deshabilitado

source: Include cursor
es: Incluir cursor

source: Whether to include mouse cursor in screenshot.
es: Incluir o no el cursor del ratón en la captura de pantalla.

source: Auto copy image
es: Automáticamente copiar imagen

source: Repeat last
es: Repetir última

source: Capture delay
es: Retraso de captura

source: sec.
es: seg.

source: How many seconds to wait before taking a screenshot.
es: Cuántos segundos hay que esperar antes de tomar una captura de pantalla.

source: Profile
es: Perfil

source: Choose Cinnamon recorder profile
es: Elegir perfil de grabador de Cinnamon

source: Start recording
es: Empezar a grabar

source: Record sound
es: Grabar sonido

source: Whether to record sound.
es: Grabar sonido o no.

source: Stop recording
es: Parar grabación

source: Frames per second
es: Fotogramas por segundo

source: Device options
es: Opciones de dispositivo

source: File path copied to clipboard.
es: Ruta del archivo copiada al portapapeles.

source: Image data copied to clipboard.
es: Datos de imagen copiados al portapapeles.

source: Selected storage folder doesn't exist!
es: ¡Carpeta de destino no existe!

source: Selected storage folder is not a directory!
es: ¡Carpeta de destino no es una carpeta!

source: Displaying command that will be executed
es: Viendo el comando que será ejecutado

source: Possibly malformed JSON file.
es: Posiblemente archivo JSON mal formado.

source: Check the logs.
es: Comprobar los registros.

source: Do you really want to reset this preference to its default value?
es: ¿Realmente desea restablecer esta preferencia a su valor predeterminado?

source: Do you really want to empty this preference?
es: ¿De verdad desea vaciar esta preferencia?

source: Operation aborted!
es: ¡Operación abortada!

source: Area
es: Área

source: Cinnamon UI
es: Interfaz de Cinnamon

source: Current Window
es: Ventana actual

source: Screen
es: Pantalla

source: Tooltip
es: Caja de herramientas

source: Window Menu
es: Menú de ventana

source: Window Section
es: Sección de ventana

source: Window
es: Ventana

source: Select an area by clicking and dragging
es: Seleccionar un área haciendo clic y arrastrando

source: Use arrow keys to move the selection
es: Utilizar las teclas de flecha para mover la selección

source: Use SHIFT and arrow keys to resize the selection
es: Utilizar MAYÚS y las teclas de flecha para redimensionar la selección

source: Press ENTER to confirm or ESC to cancel
es: Presionar ENTRAR para confirmar o ESCAPE para cancelar

source: Select a UI element by moving the mouse
es: Seleccione un elemento de la interfaz de usuario moviendo el ratón

source: Use mouse wheel to traverse hierarchy
es: Usar la rueda del ratón para atravesar la jerarquía.

source: Hold SHIFT to allow clicking UI element
es: Mantenga presionada la tecla MAYÚS para permitir hacer clic en el elemento de la interfaz

source: Click to complete the capture, or ESC to cancel
es: Haga clic para completar la captura, o ESCAPE para cancelar

source: File no longer available
es: Archivo ya no disponible

source: Delete
es: Borrar

source: Delete captured file from file system.
es: Borrar archivo de captura del archivo de sistemas.

source: Copy data
es: Copiar datos

source: Copy image data to clipboard.
es: Copiar datos de imagen al portapapeles.

source: Copy path
es: Copiar ruta

source: Copy image path to clipboard.
es: Copiar ruta de la imagen al portapapeles.

source: Do you really want to delete this file?
es: ¿De verdad desea borrar este archivo?

source: Failed copying image data.
es: Error al copiar los datos de la imagen.

source: Left click
es: Clic izquierdo

source: Open image file.
es: Abrir archivo de imagen.

source: Open folder.
es: Abrir carpeta.

source: Right click
es: Clic derecho

source: WARNING!!!
es: ¡ADVERTENCIA!

source: Screenshot and screencasting tools.
es: Capturas de pantalla y herramientas de screencasting.

source: Desktop Capture (Fork By Odyseus)
es: Captura de Escritorio (Modificado por Odyseus)

source: Encoder: H264 Muxer: Matroska File extension: mkv
es: Codificador: H264 Muxer: Matroska Extensión de archivo: mkv

source: ImageMagick
es: ImageMagic
